{
  "sections": {
    "overview": {
      "title": "Overview",
      "content": "`cx` is a command-line tool for defining and managing the set of local files provided as context to a large language model.",
      "subsections": [
        {
          "title": "Key Features",
          "content": "*   **Rule-based Definition**: Uses a `.grove/rules` file with gitignore-style patterns to specify which files to include or exclude from the context.\n*   **Hot and Cold Context**: The rules file can be split by a `---` separator. Files matched by rules above the separator are considered \"hot\" (dynamic), while files below are \"cold\" (cacheable).\n*   **Workspace Integration**: Resolves aliases (e.g., `@a:my-project/src`) to include files from other Grove workspaces discovered on the local filesystem.\n*   **External Repository Support**: Includes files from external Git repositories. The `cx repo` subcommand manages cloning, version pinning, and auditing of these repositories. Rules can reference them via aliases like `@a:git:owner/repo@version::ruleset`.\n*   **Dynamic Rule Generation**: The `cx from-git` and `cx from-cmd` subcommands generate rules from Git history or the output of arbitrary shell commands.\n*   **Named Rule Sets**: The `cx rules` subcommand manages multiple named rule sets stored in local `.cx/` (version-controlled) and `.cx.work/` (untracked) directories, enabling switching between different contexts.\n*   **Interactive Visualization**: The `cx view` command launches a terminal user interface (TUI) to visualize the project's file tree, showing which files are included (hot/cold), explicitly excluded, or omitted.\n*   **Context Analysis**: The `cx stats` command provides a detailed breakdown of the context, including token counts, file sizes, language distribution, and largest files. `cx diff` compares the current context against a named rule set."
        },
        {
          "title": "How It Works",
          "content": "The tool operates on a set of rules defined in a text file. The active rules file is determined by checking the following locations in order:\n1.  A path stored in `.grove/state` (set via `cx rules set`).\n2.  A local `.grove/rules` file.\n3.  A legacy `.grovectx` file.\n4.  A default rules path defined in the project's `grove.yml`.\n\nWhen a command like `cx generate` is run, `cx` reads the active rules file. It recursively expands any import directives (`@default`, `@a:project::ruleset`, `@a:git:...`) to create a final, flat list of patterns. It then walks the file system, applying these patterns in order and respecting `.gitignore` files. The logic follows the principle that the last matching pattern wins.\n\nThe final list of file paths is used to generate two primary artifacts in the `.grove/` directory:\n*   `context`: A concatenated file containing the content of all \"hot\" files.\n*   `cached-context`: A concatenated file containing the content of all \"cold\" files.\n\nOther tools in the Grove ecosystem, such as `grove-gemini` and `grove-flow`, use these generated files as context for LLM requests."
        },
        {
          "title": "Commands",
          "content": "### Core Context Management\n*   `cx generate`: Generates `.grove/context` and `.grove/cached-context` from the active rules.\n*   `cx show`: Prints the content of the generated `.grove/context` file to standard output.\n*   `cx list`: Lists the absolute paths of all files included in the hot context.\n*   `cx reset`: Resets the `.grove/rules` file to a default state, either from `grove.yml` or a basic boilerplate.\n*   `cx edit`: Opens the active rules file in the default editor (`$EDITOR`).\n\n### Interactive Tools\n*   `cx view`: Launches an interactive TUI to visualize the context file tree.\n*   `cx rules`: Launches an interactive TUI to manage named rule sets.\n\n### Rule Set Management\n*   `cx rules list`: Lists all available named rule sets from `.cx/` and `.cx.work/`.\n*   `cx rules set \u003cname\u003e`: Sets a named rule set as the active context source (read-only).\n*   `cx rules load \u003cname\u003e`: Copies a named rule set to `.grove/rules` to serve as an editable working copy.\n*   `cx rules save \u003cname\u003e`: Saves the current `.grove/rules` content to a new named rule set in `.cx/`.\n*   `cx rules rm \u003cname\u003e`: Deletes a named rule set.\n\n### Analysis and Validation\n*   `cx stats`: Displays detailed statistics about the context composition (token counts, file sizes, languages).\n*   `cx diff [ruleset]`: Compares the current context against a named rule set (or an empty context).\n*   `cx validate`: Checks for missing files, duplicates, or permission issues in the context file list.\n\n### Dynamic Rule Generation\n*   `cx from-git`: Populates `.grove/rules` with files based on Git history (e.g., from recent commits or staged changes).\n*   `cx from-cmd \u003ccommand\u003e`: Populates `.grove/rules` with file paths from the standard output of a shell command.\n\n### Repository and Workspace Management\n*   `cx repo`: Subcommands for managing external Git repositories used for context (`add`, `list`, `sync`, `audit`, `rules`).\n*   `cx workspace list`: Lists all Grove workspaces (projects, ecosystems, worktrees) discovered on the filesystem."
        },
        {
          "title": "Installation",
          "content": "Install via the Grove meta-CLI:\n\nVerify installation:",
          "code_blocks": [
            "grove install cx",
            "cx version"
          ]
        }
      ]
    }
  }
}